---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GeometryFailures.FailedReplaceCurveElemCurveDriver
source: html/a359c7cd-9195-f77d-27a6-b1deeabb366e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeometryFailures.FailedReplaceCurveElemCurveDriver Property

Failed to replace curve elem curve driver.

## Syntax (C#)
```csharp
public static FailureDefinitionId FailedReplaceCurveElemCurveDriver { get; }
```